SCHEMA = ['色泽', '根蒂', '敲声', '纹理', '脐部', '触感', '密度', '含糖率', '好瓜']
RAW_DATA = [
    ['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.697, 0.46, '是'],
    ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 0.774, 0.376, '是'],
    ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.634, 0.264, '是'],
    ['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 0.608, 0.318, '是'],
    ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.556, 0.215, '是'],
    ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 0.403, 0.237, '是'],
    ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘', 0.481, 0.149, '是'],
    ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑', 0.437, 0.211, '是'],
    ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑', 0.666, 0.091, '否'],
    ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘', 0.243, 0.267, '否'],
    ['浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑', 0.245, 0.057, '否'],
    ['浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘', 0.343, 0.099, '否'],
    ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑', 0.639, 0.161, '否'],
    ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑', 0.657, 0.198, '否'],
    ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 0.36, 0.37, '否'],
    ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑', 0.593, 0.042, '否'],
    ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑', 0.719, 0.103, '否'],
]


def peer_repr(v, dict):
    if isinstance(v, str):
        return float(dict.index(v))
    else:
        return dict.index(int(v))


seze_dict = ['', '浅白', '青绿', '乌黑']
gendi_dict = ['', '稍蜷', '蜷缩', '硬挺']
qiaosheng_dict = ['', '清脆', '浊响', '沉闷']
wengli_dict = ['', '清晰', '稍糊', '模糊']
jibu_dict = ['', '平坦', '稍凹', '凹陷']
chugan_dict = ['', '硬滑', '软粘']
haogua_dict = ['否', '是']

FLOAT_DATA = [
    [
        peer_repr(x1, seze_dict), peer_repr(x2, gendi_dict), peer_repr(x3, qiaosheng_dict),
        peer_repr(x4, wengli_dict), peer_repr(x5, jibu_dict), peer_repr(x6, chugan_dict),
        x7, x8,
        peer_repr(x9, haogua_dict)
    ]
    for [x1, x2, x3, x4, x5, x6, x7, x8, x9] in RAW_DATA
]
