import numpy as np

SCHEMA = [
    ('色泽', 'U2'),
    ('根蒂', 'U2'),
    ('敲声', 'U2'),
    ('纹理', 'U2'),
    ('脐部', 'U2'),
    ('触感', 'U2'),
    ('密度', np.float64),
    ('含糖率', np.float64),
    ('好瓜', 'U1')
]

RAW_DATA = [
    ('青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.697, 0.46, '是'),
    ('乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 0.774, 0.376, '是'),
    ('乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.634, 0.264, '是'),
    ('青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 0.608, 0.318, '是'),
    ('浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.556, 0.215, '是'),
    ('青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 0.403, 0.237, '是'),
    ('乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘', 0.481, 0.149, '是'),
    ('乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑', 0.437, 0.211, '是'),
    ('乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑', 0.666, 0.091, '否'),
    ('青绿', '硬挺', '清脆', '清晰', '平坦', '软粘', 0.243, 0.267, '否'),
    ('浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑', 0.245, 0.057, '否'),
    ('浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘', 0.343, 0.099, '否'),
    ('青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑', 0.639, 0.161, '否'),
    ('浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑', 0.657, 0.198, '否'),
    ('乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 0.36, 0.37, '否'),
    ('浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑', 0.593, 0.042, '否'),
    ('青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑', 0.719, 0.103, '否'),
]

NP_DATA = np.array(RAW_DATA, dtype=SCHEMA)


def _to_float(arr):
    if arr.dtype.type in (np.float64, np.float32):
        return arr

    def int_seq():
        xs = list(np.unique(arr))
        for e in arr:
            yield xs.index(e)

    return np.fromiter(int_seq(), dtype=np.float64)


def data():
    names = [name for name, _ in NP_DATA.dtype.descr]
    cols = [_to_float(NP_DATA[s]).reshape((-1, 1)) for s in names]
    return np.concatenate(cols, axis=1)


if __name__ == '__main__':
    print(data().shape)
